## -*- mode: ruby -*-
brew 'emacs'
brew 'global'

brew 'rbenv'
brew 'ruby-build'
brew 'plenv'
brew 'perl-build'
brew 'go'
brew 'node'
brew 'python3'

brew 'git'
brew 'hub'
brew 'tig'
brew 'diff-so-fancy'
brew 'colordiff'
brew 'ghq'

brew 'tmux'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'fzf'

brew 'ripgrep'
brew 'grep'
brew 'awscli'
brew 'htop'
brew 'coreutils'
brew 'findutils'
brew 'less'
brew 'bat'
brew 'tree'
brew 'jq'
brew 'wget'
brew 'tcping'
brew 'httping'

brew 'openssl'
brew 'libxml2'
brew 'libyaml'

brew 'nginx'
brew 'varnish'
brew 'redis'
brew 'sqlite'

tap 'heroku/brew'
brew 'heroku'

# Session Manager Plugin for AWS CLI
# https://docs.aws.amazon.com/ja_jp/systems-manager/latest/userguide/session-manager-working-with-install-plugin.html
tap 'dkanejs/aws-session-manager-plugin'
brew 'aws-session-manager-plugin'

cask_args appdir: '/Applications'
tap 'homebrew/cask'
cask 'alfred'
cask 'dash'
cask 'dropbox'
cask 'virtualbox'
cask 'vagrant'
cask 'google-cloud-sdk'
cask 'appcleaner'
cask 'paw'
cask 'licecap'
cask 'iterm2'
cask 'docker'
cask 'keepingyouawake'
cask 'firefox'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'java'
cask 'tableau-reader'

tap 'homebrew/cask-fonts'
cask 'font-source-code-pro'
cask 'font-source-han-code-jp'
