# -*- mode: ruby -*-

brew 'aspell'
brew 'awscli'
brew 'bat'
brew 'bluetoothconnector'
brew 'circleci'
brew 'clisp'
brew 'colordiff'
brew 'coreutils'
brew 'direnv'
brew 'emacs'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'ghq'
brew 'git'
brew 'git-delta'
brew 'go'
brew 'htop'
brew 'httping'
brew 'hugo'
brew 'jq'
brew 'less'
brew 'mtr'
brew 'node'
brew 'noti'
brew 'perl-build'
brew 'plenv'
brew 'python'
brew 'rbenv'
brew 'ripgrep'
brew 'ruby-build'
brew 'sqlite'
brew 'switchaudio-osx'
brew 'tcping'
brew 'telnet'
brew 'terraform-ls'
brew 'tfenv'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

tap 'heroku/brew'
brew 'heroku'

# Session Manager Plugin for AWS CLI
# https://docs.aws.amazon.com/ja_jp/systems-manager/latest/userguide/session-manager-working-with-install-plugin.html
tap 'dkanejs/aws-session-manager-plugin'
brew 'aws-session-manager-plugin'

tap 'homebrew/cask'
cask '1password'
cask 'alfred'
cask 'appcleaner'
cask 'choosy'
cask 'cleanmymac'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'gpg-suite'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keepingyouawake'
cask 'paw'

tap 'homebrew/cask-fonts'
cask 'font-source-han-code-jp'
