## -*- mode: ruby -*-
cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/dupes'
brew 'mas'

brew 'emacs'
brew 'global', args: ['--with-pygments', '--with-ctags']

brew 'rbenv'
brew 'ruby-build'
brew 'plenv'
brew 'perl-build'
brew 'go'
brew 'node'
brew 'elixir'

brew 'git', args: ['--with-pcre']
brew 'hub'
brew 'tig'
brew 'diff-so-fancy'
brew 'colordiff'

brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'zsh', args: ['--without-etcdir']
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'the_silver_searcher'
brew 'grep', args: ['--with-default-names']
brew 'awscli'
brew 'heroku'
brew 'keychain'
brew 'htop'
brew 'coreutils'
brew 'less', args: ['--with-pcre']
brew 'tree'
brew 'jq'
brew 'wget'
brew 'tcping'

brew 'openssl'
brew 'libxml2'
brew 'libyaml'
brew 'jpeg'
brew 'libpng'
brew 'imagemagick'

brew 'nginx'
brew 'varnish'
brew 'redis'
brew 'sqlite'

cask 'virtualbox'
cask 'vagrant'
cask 'google-cloud-sdk'
cask 'appcleaner'
cask 'paw'
cask 'licecap'
cask 'kindle'
# cask 'iterm2'
# cask 'docker'
# cask 'dropbox'
# cask 'firefox'
# cask 'google-chrome'
# cask 'alfred'

mas '1Password', id: 443987910
mas 'Slack', id: 803453959
mas 'Dash', id: 449589707
mas 'Skitch', id: 425955336
mas 'The Unarchiver', id: 425424353
mas 'Caffeine', id: 411246225

mas 'Numbers', id: 409203825
mas 'Keynote', id: 409183694
mas 'Pages', id: 409201541
mas 'Xcode', id: 497799835
